Repository: Davon-Rolage/GeoGem
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru

source: click on the button below to activate your GeoGem account:
ru: нажмите на кнопку ниже, чтобы активировать свой аккаунт на GeoGem:

source: Activate Account
ru: Активировать аккаунт

source: If you're having trouble clicking the Activate button, copy and paste the URL below into your web browser:
ru: Если у вас возникли проблемы с нажатием кнопки 'Активировать', скопируйте и вставьте следующий URL в адресную строку вашего веб-браузера:

source: You have requested to reset your password.
ru: Вы запросили сброс пароля.

source: Please click on the button below to set a new password:
ru: Нажмите на кнопку ниже, чтобы установить новый пароль:

source: Reset Password
ru: Сбросить пароль

source: If you're having trouble clicking the Reset Password button, copy and paste the URL below into your web browser:
ru: Если у вас возникли проблемы с нажатием кнопки "Сбросить пароль", скопируйте и вставьте следующий URL в адресную строку вашего веб-браузера:

source: The password reset link is valid for 3 days.
ru: Ссылка для смены пароля действительна 3 дня.

source: If you did not request a password reset, please ignore this email.
ru: Если вы не запрашивали смену пароля, просто проигнорируйте это письмо.

source: Login
ru: Вход

source: Register
ru: Регистрация

source: Forgot Password
ru: Сброс пароля

source: Please enter the email associated with your account.
ru: Пожалуйста, введите адрес электронной почты, связанный с вашим аккаунтом.

source: Reset password
ru: Сбросить пароль

source: Enter new password
ru: Введите новый пароль

source: Change password
ru: Сменить пароль

source: Username
ru: Имя пользователя

source: This username is already taken.
ru: Это имя пользователя уже занято.

source: Password
ru: Пароль

source: Repeat password
ru: Повторите пароль

source: Forgot password?
ru: Забыли пароль?

source: Email
ru: Электронная почта

source: Stay signed in
ru: Запомнить меня

source: Don't have an account?
ru: Нет аккаунта?

source: Register Now!
ru: Зарегистрируйся сейчас!

source: Already have an account?
ru: Уже есть аккаунт?

source: Sign In Now!
ru: Войдите сейчас

source: Registration requirements
ru: Требования к регистрации

source: <li>Only latin letters are allowed.</li> <li>Username must contain only letters, digits and . + - _</li> <li>Username must be at least 3 characters and no more than 15.</li> <li>Your password can't be too similar to your other personal information.</li> <li>Your password must contain at least 8 characters.</li> <li>Your password can't be a commonly used password.</li> <li>Your password can't be entirely numeric.</li>
ru: <li>Разрешены только латинские буквы.</li> <li>Имя пользователя должно содержать только буквы, цифры и . + - _</li> <li>Имя пользователя должно содержать не менее 3 символов и не более 15.</li> <li>Ваш пароль не может быть слишком похож на другую вашу личную информацию.</li> <li>Ваш пароль должен содержать не менее 8 символов.</li> <li>Ваш пароль не может быть общеиспользуемым паролем.</li> <li>Ваш пароль не может быть полностью числовым.</li>

source: Home
ru: Главная

source: Learn
ru: Учить

source: My Words
ru: Мои слова

source: About
ru: О проекте

source: Premium
ru: Премиум

source: Hi
ru: Здравствуй

source: My Profile
ru: Мой профиль

source: Log out
ru: Выйти

source: Admin
ru: Админ

source: Learn New Words
ru: Учить слова

source: Everyday words and phrases to help you get used to the language
ru: Повседневные слова и фразы, чтобы помочь вам освоить язык

source: Get started with GeoGem today!
ru: Начните изучать язык сегодня!

source: Learn Words
ru: Учить слова

source: More in-depth theory and language structure
ru: Углубленное изучение теории и языковой структуры

source: Grammar structure, pronunciation, cultural context, and more
ru: Грамматика, произношение, культурный контекст...

source: Study the theory of Georgian language and get a deeper understanding of the language
ru: Изучите теорию грузинского языка и улучшите свои навыки понимания языка

source: Dive Into Theory
ru: Углубиться в теорию

source: You have earned a badge! Check out your profile!
ru: Вы заработали достижение! Проверьте свой профиль!

source: The user has been successfully deleted
ru: Пользователь был успешно удален

source: Confirm your account on GeoGem
ru: Подтвердите свой аккаунт на GeoGem

source: Reset your password on GeoGem
ru: Сброс пароля на GeoGem

source: <b>{user}</b>, please check your email <b>{to_email}</b> to activate your account.
ru: <b>{user}</b>, проверьте свою почту <b>{to_email}</b> для активации своего аккаунта.

source: Please check your email <b>{to_email}</b> to reset your password.
ru: Проверьте свою почту <b>{to_email}</b> для смены пароля.

source: Thank you for confirming your email. You can now sign in to your account.
ru: Спасибо за подтверждение вашей электронной почты. Теперь вы можете войти в свою учетную запись.

source: Your password has been reset.
ru: Пароль был успешно изменён.

source: Problem sending email to <b>{to_email}</b>, please try again.
ru: Возникла ошибка при отправке письма на почту <b>{to_email}</b>, попробуйте снова.

source: Activation link is invalid! Please try again.
ru: Ссылка активации недействительна! Попробуйте снова.

source: Password reset link is invalid! Please try again.
ru: Ссылка для сброса пароля недействительна! Попробуйте снова.

source: Please fill out all the required fields.
ru: Пожалуйста, заполните все обязательные поля.

source: You must pass the reCAPTCHA test
ru: Вы должны пройти капчу

source: Username is required
ru: Имя пользователя обязательно

source: Username cannot contain spaces
ru: Имя пользователя не может содержать пробелы

source: Username contains invalid characters
ru: Имя пользователя содержит недопустимые символы

source: Username is too long
ru: Имя пользователя слишком длинное

source: Username is too short
ru: Имя пользователя слишком короткое

source: Email is invalid
ru: Недействительный адрес электронной почты

source: There is no user associated with this email
ru: Пользователя с таким адресом электронной почты не существует

source: This email is already in use
ru: Этот адрес электронной почты занят

source: Password is too short (min 8)
ru: Пароль слишком короткий (мин 8)

source: Passwords do not match
ru: Пароли не совпадают

source: Invalid username or password
ru: Неправильное имя пользователя или пароль

source: Welcome
ru: Добро пожаловать

source: Profile
ru: Профиль

source: Settings
ru: Настройки

source: Achievements
ru: Достижения

source: Date joined
ru: Дата создания аккаунта

source: You have premium status
ru: У вас есть премиум-статус

source: You have free status.
ru: У вас нет премиума.

source: Upgrade to premium
ru: Активировать премиум

source: Delete account
ru: Удалить аккаунт

source: Are you sure you want to delete your account?
ru: Вы уверены, что хотите удалить свой аккаунт?

source: Number of learned words:
ru: Количество выученных слов:

source: About GeoGem
ru: О проекте GeoGem

source: GeoGem is a project for learning Georgian words and exploring Georgian culture!
ru: GeoGem - это проект для изучения грузинских слов и грузинской культуры!

source: Source code is available on GitHub
ru: Исходный код доступен на GitHub

source: Premium is only available for registered users. Sign in and try again.
ru: Премиум доступен только для зарегистрированных пользователей. Зайдите и попробуйте снова

source: Get access to the following premium features:
ru: Получите доступ к следующим функциям премиум-аккаунта:

source: <li>Premium users can do some more</li> <li>and later they'll do much more than that</li> <li>And many more...</li>
ru: <li>Премиум юзеры то</li> <li>а потом сё</li> <li>и многое другое...</li>

source: Try out for free!
ru: Попробуй бесплатно!

source: Thank you for upgrading to premium!<br>Enjoy all the features we have to offer!
ru: Спасибо за обновление до премиума!<br>Наслаждайтесь всеми функциями премиум-аккаунта!

source: Cancel Premium
ru: Отменить премиум

source: Every time you answer a question correctly, you get a point. Incorrect answers decrease points. The more points you have, the higher your mastery level is.
ru: Каждый раз, когда вы отвечаете на вопрос правильно, вы получаете очко. Неправильные ответы уменьшают количество очков. Чем больше очков у вас есть, тем выше ваш уровень мастерства.

source: You have learned all words in this block!
ru: Вы выучили все слова в этом блоке!

source: Sign in to save your progress
ru: Войдите, чтобы сохранить свой прогресс

source: No words to review
ru: Нет слов для повторения

source: Never give up!
ru: Никогда не сдавайся

source: You cannot delete the test user
ru: Вы не можете удалить тестового пользователя

source: Name
ru: Имя

source: Image
ru: Изображение

source: Audio
ru: Аудио

source: Points
ru: Очки

source: Level
ru: Уровень

source: Mastery level
ru: Уровень мастерства

source: Transliteration
ru: Транслитерация

source: Translation
ru: Перевод

source: Example
ru: Пример

source: Example Image
ru: Картинка примера

source: Updated at
ru: Дата изменения

source: Added at
ru: Дата добавления

source: No words learned in this block
ru: Нет выученных слов из этого блока

source: words
ru: слов

source: learned
ru: выучено

source: Review
ru: Повторить слова

source: Start Quiz
ru: Начать викторину

source: Block Mastery Level:
ru: Уровень мастерства блока:

source: List of words
ru: Список слов

source: Theory
ru: Теория

source: Tap on each title to view the contents
ru: Нажмите на заголовок блока, чтобы увидеть его содержимое

source: Learning Georgian Words
ru: Изучение грузинских слов

source: to level
ru: до уровня

source: Sign in to view level progress
ru: Войдите, чтобы сохранить свой прогресс

source: Next
ru: Дальше

source: Previous
ru: Назад

source: End Quiz
ru: Закончить викторину

source: Results
ru: Результаты

source: Go back to
ru: Перейти обратно в

source: Learn More Words
ru: Учить еще слова

source: Review Again
ru: Повторить заново

source: Start Again
ru: Начать заново

source: Go to Index
ru: На главную
